app/controllers/pages_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
---
  def dashboard
    @properties = current_user.properties.all.order("created_at DESC")

SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
---
  def test_page
    @properties = current_user.properties.all.order("created_at DESC")