app/controllers/properties_controller.rb

  def index
    @user = current_user
    @properties = current_user.properties.all.order("created_at DESC")
---
SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1 AND ( address OR city OR state OR zip LIKE '%fort lauderdale%') ORDER BY created_at DESC  [["user_id", 1]]

  def show
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

  def edit
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

  def create
    @user = current_user
    # @property = Property.new(property_params)
    @property = @user.properties.build(property_params)

    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("description", "latitude", "longitude", "address", "link", "city", "state", "zip", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    respond_to do |format|
      if @property.update(property_params)
---
UPDATE "properties" SET "latitude" = $1, "longitude" = $2, "address" = $3, "state" = $4, "updated_at" = $5 WHERE "properties"."id" = $6  [["latitude", 26.124006103663156], ["longitude", -80.12741070662358], ["address", "151 Northeast 16th Avenue"], ["state", "Florida"], ["updated_at", "2020-04-13 03:26:30.928072"], ["id", 1]]

  def destroy
    @user = current_user

    @property.destroy
---
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 31]]

    def set_property
      @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

    def property_og
      @property_og_id = @property.user_id
      @property_og = User.find_by_id(@property_og_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]