app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    @user = current_user
    @properties = Property.all